<?xml version="1.0" encoding="UTF-8"?>

<!-- This is an automatically generated file. -->
<Chapter Label="Chapter_Obtaining_Core-Free_Subgroups">
<Heading>Obtaining Core-Free Subgroups</Heading>

<Section Label="Chapter_Obtaining_Core-Free_Subgroups_Section_Core-Free_Subgroups">
<Heading>Core-Free Subgroups</Heading>

<P/>
 A core-free subgroup is a subgroup in which its (normal) core is trivial.
<P/>
<ManSection>
  <Func Arg="G, H" Name="IsCoreFree" />
 <Returns>a boolean
</Returns>
 <Description>
 Given a group <A>G</A> and one of its subgroups <A>H</A>, it returns whether <A>H</A> is core-free in <A>G</A>.
<Example><![CDATA[
gap> LoadPackage("CoreFreeSub");;
gap> G := SymmetricGroup(4);; H := Subgroup(G, [(1,3)(2,4)]);;
gap> Core(G,H);
Group(())
gap> IsCoreFree(G,H);
true
gap> H := Subgroup(G, [(1,4)(2,3), (1,3)(2,4)]);;
gap> IsCoreFree(G,H);
false
gap> Core(G,H); # H is a normal subgroup of G, hence it does not have a trivial core
Group([ (1,4)(2,3), (1,3)(2,4) ])
]]></Example>


 </Description>
</ManSection>


<P/>
<ManSection>
  <Func Arg="G" Name="CoreFreeConjugacyClassesSubgroups" />
 <Returns>a list
</Returns>
 <Description>
  Returns a list of all conjugacy classes of core-free subgroups of <A>G</A>
<Example><![CDATA[
gap> LoadPackage("CoreFreeSub");;
gap> G := SymmetricGroup(4);; dh := DihedralGroup(10);;
gap> CoreFreeConjugacyClassesSubgroups(G);
[ Group( () )^G, Group( [ (1,3)(2,4) ] )^G, Group( [ (3,4) ] )^G, Group( [ (2,4,3) ] )^G, Group( [ (3,4), (1,2)(3,4) ] )^G, Group( [ (1,3,2,4), (1,2)(3,4) ] )^G, Group( [ (3,4), (2,4,3) ] )^G ]
gap> CoreFreeConjugacyClassesSubgroups(dh);
[ Group( <identity> of ... )^G, Group( [ f1 ] )^G ] 
]]></Example>


 </Description>
</ManSection>


<P/>
<ManSection>
  <Func Arg="G" Name="AllCoreFreeSubgroups" />
 <Returns>a list
</Returns>
 <Description>
  Returns a list of all core-free subgroups of <A>G</A>
<Example><![CDATA[
gap> LoadPackage("CoreFreeSub");;
gap> G := SymmetricGroup(4);; dh := DihedralGroup(10);;
gap> AllCoreFreeSubgroups(G);
[ Group(()), Group([ (1,3)(2,4) ]), Group([ (1,4)(2,3) ]), Group([ (1,2)(3,4) ]), Group([ (3,4) ]), Group([ (2,4) ]), Group([ (2,3) ]), Group([ (1,4) ]), Group([ (1,3) ]), Group([ (1,2) ]), Group([ (2,4,3) ]), Group([ (1,3,2) ]), Group([ (1,3,4) ]), Group([ (1,4,2) ]), Group([ (3,4), (1,2)(3,4) ]), Group([ (2,4), (1,3)(2,4) ]), Group([ (2,3), (1,4)(2,3) ]), Group([ (1,3,2,4), (1,2)(3,4) ]), Group([ (1,2,3,4), (1,3)(2,4) ]), Group([ (1,2,4,3), (1,4)(2,3) ]), Group([ (3,4), (2,4,3) ]), Group([ (1,3), (1,3,2) ]), Group([ (1,3), (1,3,4) ]), Group([ (1,4), (1,4,2) ]) ]
gap> AllCoreFreeSubgroups(dh);
[ Group([  ]), Group([ f1 ]), Group([ f1*f2^2 ]), Group([ f1*f2^4 ]), Group([ f1*f2 ]), Group([ f1*f2^3 ]) ]
]]></Example>


 </Description>
</ManSection>


</Section>


<Section Label="Chapter_Obtaining_Core-Free_Subgroups_Section_Degrees_of_Core-Free_subgroups">
<Heading>Degrees of Core-Free subgroups</Heading>

<P/>
<ManSection>
  <Func Arg="G" Name="CoreFreeDegrees" />
 <Returns>a list
</Returns>
 <Description>
  Returns a list of all possible degrees of faithful transitive permutation representations of <A>G</A>. The degrees of a faithful transitive permutation representation of <A>G</A> are the index of its core-free subgroups.
<Example><![CDATA[
gap> LoadPackage("CoreFreeSub");;
gap> G := SymmetricGroup(4);; dh := DihedralGroup(10);;
gap> CoreFreeDegrees(G);
[ 24, 12, 8, 6, 4 ]
gap> CoreFreeDegrees(dh);
[10, 5]
]]></Example>


 </Description>
</ManSection>


</Section>


</Chapter>

